from math import pi, cos # noqa: F401
# Активная зона - до тягового участка - тяговый участок - горизонтальный участок до ПГ - ПГ - подъемный участок до насоса-
# горизонтальный участок до САОР - САОР - опускной участок - горизонтальный участок до АЗ
# Общее
Q = 700000000
T_az = 500 + 273.15 # Температура стенки активной зоны (в градусах)
T_pg = 350 + 273.15 # Температура стенки парогенератора (в градусах)
T0 = 350 + 273.15 # Температура свинца в начале
Gpb = 23761       # Расход свинца
aPb = 12.14 * 10 ** (-6)  # коэффициент температуропроводности свинца
lambdaPb = 18.53  # лямда свинца
cp_Pb = 147.3  # коэффициент теплопередачи свинца
dt = 0.05 # шаг по времени
p = 1000000   # давление              
R = 40.11  # Универсальная постоянная для свинца
g = 9.81
eps = 0.05  # Допустимая невязка по давению
# Активная зона высота 2,25 - 4,25
r_az = 1.148
s_az = pi * r_az**2
s_tvel = pi*(9.1**2 * 57 + 9.6**2 * 72 + 10.4**2 * 56) / 4 * 10 ** (-6) * 114
f_az = s_az - s_tvel
# dg_az = 4 * f_az / (2 * pi * r_az + 114 * pi * 0.001 * (57 * 9.1 + 72 * 9.6 + 56 * 10.4))
dg_az = 0.01
n_az = 30
h_az = 2
dx_az = h_az / n_az
# Область до тягового участка
h_1 = 5.25 - 4.25
n_1 = 5
f_1 = s_az
# Тяговый участок
h_2 = 10.25 - 5.25
n_2 = 5
d_2 = 5.3
f_2 = pi * d_2 ** 2 / 4
# Горизонтальный участок до ПГ
l_3 = 2
n_3 = 5
d_3 = 2
f_3 = pi * d_3 ** 2 / 4
# Парогенератор
d_pg = 2
s = (pi * d_pg ** 2 / 4) * 8 
f_pg = 4.5
s_pg = s - f_pg 
d_tube = (4 * s_pg / pi) ** 0.5
#dg_pg = 4 * f_pg / (pi * (d_tube + 8 * d_pg))
dg_pg = 0.05
h_pg = 7.75 - 3.05
n_pg = 47
# Подъемный участок через ГЦН
f_4 = 9.5
h_4 = 9.05 - 3.05
n_4 = 12
# Горизонтальный участок до САОР
l_5 = 2
f_5 = 1.8
n_5 = 5
# Участок САОР
h_saor = 7
n_saor = 36
d_test = 0.5
# Опускной участок 
h_6 = 2.15
n_6 = 5
d_6 = 0.5
f_6 = pi * d_6 ** 2 * 0.25
# Горизронтальный участок до АЗ
l_7 = 12
f_7 = 1.8
n_7 = 7

N = n_az + n_1 + n_2 + n_3 + n_4 + n_saor + n_5 + n_pg + n_6 + n_7 