from math import pi, cos # noqa: F401
# Общее
Q = 700000000
T_az = 500 + 273.15 # Температура стенки активной зоны (в градусах)
T_pg = 350 + 273.15 # Температура стенки парогенератора (в градусах)
T0 = 350 + 273.15 # Температура свинца в начале
Gpb = 23761  # Расход свинца
aPb = 12.14 * 10 ** (-6)  # коэффициент температуропроводности свинца
lambdaPb = 18.53  # лямда свинца
cp_Pb = 147.3  # коэффициент теплопередачи свинца
dt = 0.05  # шаг по времени
p = 1000000   # давление              
R = 40.11  # Универсальная постоянная для свинца
g = 9.81
# Активная зона высота 2,25 - 4,25
r_az = 1.148
s_az = pi * r_az**2
s_tvel = pi*(9.1**2 * 57 + 9.6**2 * 72 + 10.4**2 * 56) / 4 * 10 ** (-6) * 114
#f_az = s_az - s_tvel
#dg_az = 4 * f_az / (2 * pi * r_az + 114 * pi * 0.001 * (57 * 9.1 + 72 * 9.6 + 56 * 10.4))
f_az = 1.5
dg_az = 0.015
n_az = 40
h_az = 3
dx_az = h_az / n_az
# Область до тягового участка
h_1 = 5.25 - 4.25
n_1 = 5
f_1 = s_az
# Тяговый участок
h_2 = 7.75 - 5.25
n_2 = 5
d_2 = 5.3
f_2 = pi * d_2 ** 2 / 4
# Парогенератор
d_pg = 2
s = (pi * d_pg ** 2 / 4) * 8 
f_pg = 3
s_pg = s - f_pg
d_tube = (4 * s_pg / pi) ** 0.5
dg_pg = 4 * f_pg / (pi * (d_tube + 8 * d_pg))
d_tube_1 = (4 * (pi * d_pg ** 2 * 0.5 - f_pg / 8) / pi) ** 0.5
dg_pg_1 = 0.5 * f_pg / (pi*(d_tube_1 + d_pg))
h_pg = 7.75 - 3.05
n_pg = 47
# Подъемный участок через ГЦН
f_3 = 9.5
h_3 = 9.05 - 3.05
n_3 = 12
# Опускной участок
f_4 = 19
h_4 = 9
n_4 = 9
# Горизонтальный участок
l_5 = 7.5
f_5 = 1.8
n_5 = 10
# Подъемный участок до активной зоны
f_6 = 19
h_6 = 2.25
n_6 = 5

N = n_1 + n_az + n_2 + n_3 + n_pg + n_4 + n_5 + n_6
'''n1 = 36
n2 = 11
d1 = 0.215
d2 = 0.219
d3 = 0.224
d4 = 0.225
d5 = 0.316
d6 = 0.324
d7 = 0.5
h1 = 7.0
h2 = 5.0
h = 12.0
X1 = h1 / (n1 - 1)
X2 = h2 / (n2 - 1)
Gpb_full = 200.0
Gair_full = float(input("Введите расход: "))
Gpb = Gpb_full / 12
Gair = Gair_full / 12
T2 = 380.0 + 273.15  # Температура выхода воздуха
T1 = 39.0 + 273.15  # Температура входа воздуха
T3 = 600.0 + 273.15  # Температура входа свинца
TAr = 600.0 + 273.15
e1 = 0.45  # Степень черноты первой стенки
e2 = 0.8  # Степень черноты второй стенки
C0 = 5.67 * 10 ** (-8)  # Постоянная Стеффана-Больцмана
lamw1 = 18.8  # коэффициент теплопроводности внутренней стенки
lamw2 = 21.0  # коэффициент теплопроводности внешней стенки
lam_gas = 0.035
lam_ch = 18.8  # коэффициент теплопроводности чехла
Tw2 = T3 - 22
Tw1 = Tw2 - 220
alphaAr = 5.0
RoPb = 10360.0  # Плотность свинца
aPb = 12.14 * 10 ** (-6)  # коэффициент температуропроводности свинца
lambdaPb = 18.53  # лямда свинца
Cp_down = 1009.0
Cp_up = 1040.0
Cp_Pb = 147.3
p = 10 ** 5  # давление
R = 286.7  # Универсальная постоянная для воздуха
Pr_air = 0.7
'''